feaser/openblt/nucleo_f429zi_demos/Target/Demo/ARMCM0_S32K11_S32K118EVB_GCC/Boot/lib/S32K118.h
/** MTB_DWT - Register Layout Typedef */
typedef struct {
  __I  uint32_t CTRL;                              /**< MTB DWT Control Register, offset: 0x0 */
       uint8_t RESERVED_0[28];
  struct {                                         /* offset: 0x20, array step: 0x10 */
    __IO uint32_t COMP;                              /**< MTB_DWT Comparator Register, array offset: 0x20, array step: 0x10 */
    __IO uint32_t MASK;                              /**< MTB_DWT Comparator Mask Register, array offset: 0x24, array step: 0x10 */
    __IO uint32_t FCT;                               /**< MTB_DWT Comparator Function Register 0..MTB_DWT Comparator Function Register 1, array offset: 0x28, array step: 0x10 */
         uint8_t RESERVED_0[4];
  } CMF[MTB_DWT_CMF_COUNT];
       uint8_t RESERVED_1[448];
  __IO uint32_t TBCTRL;                            /**< MTB_DWT Trace Buffer Control Register, offset: 0x200 */
       uint8_t RESERVED_2[3524];
  __I  uint32_t DEVICECFG;                         /**< Device Configuration Register, offset: 0xFC8 */
  __I  uint32_t DEVICETYPID;                       /**< Device Type Identifier Register, offset: 0xFCC */
  __I  uint32_t PERIPHID[MTB_DWT_PERIPHID_COUNT];  /**< Peripheral ID Register, array offset: 0xFD0, array step: 0x4 */
  __I  uint32_t COMPID[MTB_DWT_COMPID_COUNT];      /**< Component ID Register, array offset: 0xFF0, array step: 0x4 */
} MTB_DWT_Type, *MTB_DWT_MemMapPtr;

 /** Number of instances of the MTB_DWT module. */
#define MTB_DWT_INSTANCE_COUNT                   (1u)


/* MTB_DWT - Peripheral instance base addresses */
/** Peripheral MTB_DWT base address */
#define MTB_DWT_BASE                             (0xF0001000u)
/** Peripheral MTB_DWT base pointer */
#define MTB_DWT                                  ((MTB_DWT_Type *)MTB_DWT_BASE)
/** Array initializer of MTB_DWT peripheral base addresses */
#define MTB_DWT_BASE_ADDRS                       { MTB_DWT_BASE }
/** Array initializer of MTB_DWT peripheral base pointers */
#define MTB_DWT_BASE_PTRS                        { MTB_DWT }

/* ----------------------------------------------------------------------------
   -- MTB_DWT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MTB_DWT_Register_Masks MTB_DWT Register Masks
 * @{
 */

/* CTRL Bit Fields */
#define MTB_DWT_CTRL_DWTCFGCTRL_MASK             0xFFFFFFFu
#define MTB_DWT_CTRL_DWTCFGCTRL_SHIFT            0u
#define MTB_DWT_CTRL_DWTCFGCTRL_WIDTH            28u
#define MTB_DWT_CTRL_DWTCFGCTRL(x)               (((uint32_t)(((uint32_t)(x))<<MTB_DWT_CTRL_DWTCFGCTRL_SHIFT))&MTB_DWT_CTRL_DWTCFGCTRL_MASK)
#define MTB_DWT_CTRL_NUMCMP_MASK                 0xF0000000u
#define MTB_DWT_CTRL_NUMCMP_SHIFT                28u
#define MTB_DWT_CTRL_NUMCMP_WIDTH                4u
#define MTB_DWT_CTRL_NUMCMP(x)                   (((uint32_t)(((uint32_t)(x))<<MTB_DWT_CTRL_NUMCMP_SHIFT))&MTB_DWT_CTRL_NUMCMP_MASK)
/* COMP Bit Fields */
#define MTB_DWT_COMP_COMP_MASK                   0xFFFFFFFFu
#define MTB_DWT_COMP_COMP_SHIFT                  0u
#define MTB_DWT_COMP_COMP_WIDTH                  32u
#define MTB_DWT_COMP_COMP(x)                     (((uint32_t)(((uint32_t)(x))<<MTB_DWT_COMP_COMP_SHIFT))&MTB_DWT_COMP_COMP_MASK)
/* MASK Bit Fields */
#define MTB_DWT_MASK_MASK_MASK                   0x1Fu
#define MTB_DWT_MASK_MASK_SHIFT                  0u
#define MTB_DWT_MASK_MASK_WIDTH                  5u
#define MTB_DWT_MASK_MASK(x)                     (((uint32_t)(((uint32_t)(x))<<MTB_DWT_MASK_MASK_SHIFT))&MTB_DWT_MASK_MASK_MASK)
/* FCT Bit Fields */
#define MTB_DWT_FCT_FUNCTION_MASK                0xFu
#define MTB_DWT_FCT_FUNCTION_SHIFT               0u
#define MTB_DWT_FCT_FUNCTION_WIDTH               4u
#define MTB_DWT_FCT_FUNCTION(x)                  (((uint32_t)(((uint32_t)(x))<<MTB_DWT_FCT_FUNCTION_SHIFT))&MTB_DWT_FCT_FUNCTION_MASK)
#define MTB_DWT_FCT_DATAVMATCH_MASK              0x100u
#define MTB_DWT_FCT_DATAVMATCH_SHIFT             8u
#define MTB_DWT_FCT_DATAVMATCH_WIDTH             1u
#define MTB_DWT_FCT_DATAVMATCH(x)                (((uint32_t)(((uint32_t)(x))<<MTB_DWT_FCT_DATAVMATCH_SHIFT))&MTB_DWT_FCT_DATAVMATCH_MASK)
#define MTB_DWT_FCT_DATAVSIZE_MASK               0xC00u
#define MTB_DWT_FCT_DATAVSIZE_SHIFT              10u
#define MTB_DWT_FCT_DATAVSIZE_WIDTH              2u
#define MTB_DWT_FCT_DATAVSIZE(x)                 (((uint32_t)(((uint32_t)(x))<<MTB_DWT_FCT_DATAVSIZE_SHIFT))&MTB_DWT_FCT_DATAVSIZE_MASK)
#define MTB_DWT_FCT_DATAVADDR0_MASK              0xF000u
#define MTB_DWT_FCT_DATAVADDR0_SHIFT             12u
#define MTB_DWT_FCT_DATAVADDR0_WIDTH             4u
#define MTB_DWT_FCT_DATAVADDR0(x)                (((uint32_t)(((uint32_t)(x))<<MTB_DWT_FCT_DATAVADDR0_SHIFT))&MTB_DWT_FCT_DATAVADDR0_MASK)
#define MTB_DWT_FCT_MATCHED_MASK                 0x1000000u
#define MTB_DWT_FCT_MATCHED_SHIFT                24u
#define MTB_DWT_FCT_MATCHED_WIDTH                1u
#define MTB_DWT_FCT_MATCHED(x)                   (((uint32_t)(((uint32_t)(x))<<MTB_DWT_FCT_MATCHED_SHIFT))&MTB_DWT_FCT_MATCHED_MASK)
/* TBCTRL Bit Fields */
#define MTB_DWT_TBCTRL_ACOMP0_MASK               0x1u
#define MTB_DWT_TBCTRL_ACOMP0_SHIFT              0u
#define MTB_DWT_TBCTRL_ACOMP0_WIDTH              1u
#define MTB_DWT_TBCTRL_ACOMP0(x)                 (((uint32_t)(((uint32_t)(x))<<MTB_DWT_TBCTRL_ACOMP0_SHIFT))&MTB_DWT_TBCTRL_ACOMP0_MASK)
#define MTB_DWT_TBCTRL_ACOMP1_MASK               0x2u
#define MTB_DWT_TBCTRL_ACOMP1_SHIFT              1u
#define MTB_DWT_TBCTRL_ACOMP1_WIDTH              1u
#define MTB_DWT_TBCTRL_ACOMP1(x)                 (((uint32_t)(((uint32_t)(x))<<MTB_DWT_TBCTRL_ACOMP1_SHIFT))&MTB_DWT_TBCTRL_ACOMP1_MASK)
#define MTB_DWT_TBCTRL_NUMCOMP_MASK              0xF0000000u
#define MTB_DWT_TBCTRL_NUMCOMP_SHIFT             28u
#define MTB_DWT_TBCTRL_NUMCOMP_WIDTH             4u
#define MTB_DWT_TBCTRL_NUMCOMP(x)                (((uint32_t)(((uint32_t)(x))<<MTB_DWT_TBCTRL_NUMCOMP_SHIFT))&MTB_DWT_TBCTRL_NUMCOMP_MASK)
/* DEVICECFG Bit Fields */
#define MTB_DWT_DEVICECFG_DEVICECFG_MASK         0xFFFFFFFFu
#define MTB_DWT_DEVICECFG_DEVICECFG_SHIFT        0u
#define MTB_DWT_DEVICECFG_DEVICECFG_WIDTH        32u
#define MTB_DWT_DEVICECFG_DEVICECFG(x)           (((uint32_t)(((uint32_t)(x))<<MTB_DWT_DEVICECFG_DEVICECFG_SHIFT))&MTB_DWT_DEVICECFG_DEVICECFG_MASK)
/* DEVICETYPID Bit Fields */
#define MTB_DWT_DEVICETYPID_DEVICETYPID_MASK     0xFFFFFFFFu
#define MTB_DWT_DEVICETYPID_DEVICETYPID_SHIFT    0u
#define MTB_DWT_DEVICETYPID_DEVICETYPID_WIDTH    32u
#define MTB_DWT_DEVICETYPID_DEVICETYPID(x)       (((uint32_t)(((uint32_t)(x))<<MTB_DWT_DEVICETYPID_DEVICETYPID_SHIFT))&MTB_DWT_DEVICETYPID_DEVICETYPID_MASK)
/* PERIPHID Bit Fields */
#define MTB_DWT_PERIPHID_PERIPHID_MASK           0xFFFFFFFFu
#define MTB_DWT_PERIPHID_PERIPHID_SHIFT          0u
#define MTB_DWT_PERIPHID_PERIPHID_WIDTH          32u
#define MTB_DWT_PERIPHID_PERIPHID(x)             (((uint32_t)(((uint32_t)(x))<<MTB_DWT_PERIPHID_PERIPHID_SHIFT))&MTB_DWT_PERIPHID_PERIPHID_MASK)
/* COMPID Bit Fields */
#define MTB_DWT_COMPID_COMPID_MASK               0xFFFFFFFFu
#define MTB_DWT_COMPID_COMPID_SHIFT              0u
#define MTB_DWT_COMPID_COMPID_WIDTH              32u
#define MTB_DWT_COMPID_COMPID(x)                 (((uint32_t)(((uint32_t)(x))<<MTB_DWT_COMPID_COMPID_SHIFT))&MTB_DWT_COMPID_COMPID_MASK)

/*!
 * @}
 */ /* end of group MTB_DWT_Register_Masks */


/*!
 * @}
 */ /* end of group MTB_DWT_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PCC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PCC_Peripheral_Access_Layer PCC Peripheral Access Layer
 * @{
 */


/** PCC - Size of Registers Arrays */
#define PCC_PCCn_COUNT                           116u

/** PCC - Register Layout Typedef */
typedef struct {
  __IO uint32_t PCCn[PCC_PCCn_COUNT];              /**< PCC Reserved Register 0..PCC CMP0 Register, array offset: 0x0, array step: 0x4 */
} PCC_Type, *PCC_MemMapPtr;

 /** Number of instances of the PCC module. */
#define PCC_INSTANCE_COUNT                       (1u)


/* PCC - Peripheral instance base addresses */
/** Peripheral PCC base address */
#define PCC_BASE                                 (0x40065000u)
/** Peripheral PCC base pointer */
#define PCC                                      ((PCC_Type *)PCC_BASE)
/** Array initializer of PCC peripheral base addresses */
#define PCC_BASE_ADDRS                           { PCC_BASE }
/** Array initializer of PCC peripheral base pointers */
#define PCC_BASE_PTRS                            { PCC }

